MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_MK20D5.c
/*------------------------------------------------------------------------------
 *      RL-ARM - USB
 *------------------------------------------------------------------------------
 *      Name:    usbh_MK20D5.c
 *      Purpose: USB Full/Low-speed Host Freescale Kinetis MKxx Driver module
 *      Rev.:    V4.70
 *------------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <RTL.h>
#include <rl_usb.h>
#include "usbh_MKxx.h"
#include <MK20D5.h>
#include <string.h>


/************************** Host Controller Driver Structure ******************/

USBH_HCD usbh0_hcd = {                  /* Host Controller Driver structure   */
  USBH_Get_Capabilities,                /* Get driver capabilities            */
  USBH_Delay_ms,                        /* Delay in ms                        */
  USBH_Pins_Config,                     /* Config/Unconfig pins               */
  USBH_Init,                            /* Init/Uninit Host Controller        */
  USBH_Port_Power,                      /* On/Off Port Power                  */
  USBH_Port_Reset,                      /* Reset port                         */
  USBH_Get_Connect,                     /* Get port conn/disconn status       */
  USBH_Get_Speed,                       /* Get port enumerated speed          */
  USBH_EP_Add,                          /* Add Endpoint                       */
  USBH_EP_Config,                       /* (Re)Configure Endpoint             */
  USBH_EP_Remove,                       /* Remove Endpoint                    */
  USBH_URB_Submit,                      /* Submit USB Block Request           */
  USBH_URB_Cancel                       /* Cancel USB Block Request           */
};


/************************** Driver Settings ***********************************/

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

//  <o0> Size of memory used by the OTG-FS USB Host Controller <1-1048576>
//  <i> This is a size of memory (in bytes) that the USB Host Controller 
//  <i> will use for USB communication data.
#define USBH_MK_SZ_MPOOL          0x00000234


/************************** Variable and Memory Definitons ********************/

#define DEBOUNCE_500ms            500

/* Maximum number of endpoints */
#define OTG_MAX_EP                16

/* Position Buffer Descriptor Table in memory */
static USBH_MK_BD     USBH_MK_BDT    [4] __attribute__((aligned(512)));

/* Reserve memory for memory pool */ 
static U32            USBH_MK_MPOOL  [(USBH_MK_SZ_MPOOL+3)>>2];

static USBH_MK_DEV_EP USBH_DEV_EP    [OTG_MAX_EP<<1] = { 0 };

static BOOL HW_Busy           = { __FALSE };
static U16  cntDebounce       = { 0 };
static U32  calDelay          =   0  ;
static U32  Port_Discon_Evt   = { 0 };
static U32  Port_Speed        = { 0 };
static U32  Port_Con          = { 0 };
static U32  EP_Data           = { 0 };


/************************** Local Module Functions ****************************/

/***----------------------- Auxiliary Functions ----------------------------***/

/*------------------------- USBH_MK_GetEPIndexFromHandle -----------------------
 *
 *  Get the Endpoint index from it's handle
 *
 *  Parameter:  hndl:       Pointer to the Endpoint
 *  Return:                 Endpoint index (even - INs, odd - OUTs)
 *----------------------------------------------------------------------------*/

__inline U8 USBH_MK_GetEPIndexFromHandle (U32 hndl) {
  return (((hndl - ((U32)&USBH_DEV_EP[0])) / (sizeof(USBH_MK_DEV_EP))));
}


/*------------------------- USBH_MK_TransferCancel -----------------------------
 *
 *  Cancel the pending Transfer
 *
 *  Parameter:  hndl:       Pointer to the endpoint on which transfer should be canceled
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_MK_TransferCancel (U32 hndl) {
  U8 bd_idx;

  if (!hndl)
    return (__FALSE);

  bd_idx = (USBH_MK_GetEPIndexFromHandle (hndl) & 1) << 1;
  while (USBH_MK_BDT[bd_idx + 0].OWN);
  while (USBH_MK_BDT[bd_idx + 1].OWN);

  memset (&USBH_MK_BDT[bd_idx], 0, (sizeof(USBH_MK_BD) << 1));

  return (__TRUE);
}


/*------------------------- USBH_MK_TransferEnqueue ----------------------------
 *
 *  Enqueue the Transfer
 *
 *  Parameter:  hndl:       Pointer to the endpoint on which transfer will take place
 *              tgl_typ:    Toggle (bit 5..4: bit 5 - force toggle, bit 4 - value) and 
 *                          Packet type (bit 3..0: USBH_PACKET_IN, USBH_PACKET_OUT or USBH_PACKET_SETUP)
 *              buf:        Start of the receive or transmit data buffer
 *              len:        Length of the data to be received or sent
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_MK_TransferEnqueue (U32 hndl, U32 tgl_typ, U8 *buf, U32 len) {
  U8  ep_idx, bd_idx, addr, endpnt, token;
  U32 bd_ctrl;
  static U8 in_bd, out_bd;

  if ((!hndl) || (!Port_Con))
    return (__FALSE);

  ep_idx = USBH_MK_GetEPIndexFromHandle(hndl);
  if (ep_idx == 1) {
    ep_idx = 0;
  }
  addr   = ((USBH_DEV_EP[ep_idx].DEV_SPD == USBH_LS) << 7) | (USBH_DEV_EP[ep_idx].DEV_ADR & 0x7F);

  endpnt = 0;
  switch (USBH_DEV_EP[ep_idx].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK) {
    case USB_ENDPOINT_TYPE_INTERRUPT:
      endpnt = 0x4D;
      break;
    case USB_ENDPOINT_TYPE_CONTROL:
      endpnt = 0x0D;
      break;
    case USB_ENDPOINT_TYPE_BULK:
      endpnt = 0x1D;
      break;
    case USB_ENDPOINT_TYPE_ISOCHRONOUS:
      endpnt = 0x0C;
      break;
  }
  if ((Port_Speed & 3) == USBH_LS) {    /* If Low-speed                       */
    endpnt |= 0x80;
  }

  token  = USB_TOKEN_TOKENENDPT(ep_idx >> 1);
  bd_idx = 0;
  switch (tgl_typ & 0x0F) {             /* Determine BD index to use          */
    case USBH_PACKET_IN:
      bd_idx  = (0 << 1) + (in_bd << 0);
      in_bd  ^= 1;
      token  |= USB_TOKEN_TOKENPID(0x9);
      break;
    case USBH_PACKET_OUT:
      bd_idx  = (1 << 1) + (out_bd << 0);
      out_bd ^= 1;
      token  |= USB_TOKEN_TOKENPID(0x1);
      break;
    case USBH_PACKET_SETUP:
      bd_idx  = (1 << 1) + (out_bd << 0);
      out_bd ^= 1;
      endpnt |= 0x40;                   /* Disable NAK retries for setup pckt */
      token  |= USB_TOKEN_TOKENPID(0xD);
      break;
  }

  if (len > USBH_DEV_EP[ep_idx].EP_DESC.wMaxPacketSize) {   /* Limit to max sz*/
    len = USBH_DEV_EP[ep_idx].EP_DESC.wMaxPacketSize;
  }
  bd_ctrl = ((len & 0x3FF) << 16);                /* Lenght of data           */
  if ((tgl_typ >> 5) & 1) {                       /* If toggle force bit activ*/
    if ((tgl_typ >> 4) & 1)                       /* Toggle bit value         */
      bd_ctrl |= (1 << 6);
  } else {                                        /* Toggle force not active  */
    if (EP_Data & (1 << ep_idx)) 
      bd_ctrl |= (1 << 6);
  }
  bd_ctrl |= (1 << 7);                            /* OWN bit to 1             */

  USB0->ADDR                   = addr;
  USB0->ENDPOINT[0].ENDPT      = endpnt;
  USBH_MK_BDT[bd_idx].ADDR     = (U32)buf;
  USBH_MK_BDT[bd_idx].CTRL     = bd_ctrl;
  HW_Busy                      = 1;
  while (USB0->CTL & USB_CTL_TXSUSPENDTOKENBUSY_MASK);      /* Wait for ready */
  USB0->TOKEN                  = token;

  return (__TRUE);
}


/************************** Module Functions **********************************/

