MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_MK20D5.c
/*------------------------- USBH_Port_Reset ------------------------------------
 *
 *  Reset Port
 *
 *  Parameter:  port:       Root Hub port to be reset (only 0 is available)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_Port_Reset (U8 port) {

  USB0->INTEN  &= ~USB_INTEN_USBRSTEN_MASK;       /* Disable reset interrupt  */
  USB0->CTL    |=  USB_CTL_RESET_MASK;            /* Generate USB reset       */
  USBH_Delay_ms (10);                             /* Wait ~10 ms              */
  EP_Data       =  0;                             /* Endpoint data toggle rst */
  USB0->CTL    &= ~USB_CTL_RESET_MASK;            /* Stop USB reset signaling */
  USB0->CTL    |=  USB_CTL_USBENSOFEN_MASK;       /* Enable SOF generation    */
  USB0->SOFTHLD =  110;                           /* Max threshold            */
  USB0->ISTAT   =  0xFF;                          /* Clear all USB interrupts */
  USB0->INTEN  |=  USB_INTEN_TOKDNEEN_MASK |      /* Enable TOKDNE interrupt  */
                   USB_INTEN_SOFTOKEN_MASK |      /* Enable SOFTOKNE interrupt*/
                   USB_INTEN_ERROREN_MASK  |      /* Enable ERROR interrupt   */
                   USB_INTEN_USBRSTEN_MASK ;      /* Enable USBRST interrupt  */
  USB0->ERRSTAT =  0xFF;                          /* Clear all error ints     */
  USB0->ERREN  |=  USB_ERREN_BTSERREN_MASK |      /* Enable all error ints    */
                   USB_ERREN_DMAERREN_MASK |
                   USB_ERREN_BTOERREN_MASK |
                   USB_ERREN_DFN8EN_MASK   |
                   USB_ERREN_CRC16EN_MASK  |
                   USB_ERREN_CRC5EOFEN_MASK|
                   USB_ERREN_PIDERREN_MASK ;

  return (__TRUE);
}


/*------------------------- USBH_Get_Connect -----------------------------------
 *
 *  Returns connect/disconnect port events (also does debouncing)
 *
 *  Parameter:  
 *  Return:                 Connection/Disconnection events
 *----------------------------------------------------------------------------*/

static U32 USBH_Get_Connect (void) {
  U32 stat, ret;

  stat = (USB0->ISTAT >> 6) & 1;
  ret  = Port_Discon_Evt;
  ret |= ((stat ^ Port_Con) && (Port_Con));

  if (ret){                             /* If port disconnect occured         */
    Port_Discon_Evt &= ~ret;
    return (ret << 16);
  }

  if (cntDebounce) {
    cntDebounce--;
    if (!cntDebounce) {                 /* If debounce time expired           */
      ret = ((stat ^ Port_Con) && (!Port_Con));
                                        /* If debounce expired on conn 0 -> 1 */
      Port_Con |= ret;
    } else {
      USBH_Delay_ms (1);
    }
  } else if ((stat ^ Port_Con) && (!Port_Con)) {
                                        /* Restart debouncing if connect      */
    cntDebounce = DEBOUNCE_500ms;
  }

  return (ret);
}


/*------------------------- USBH_Get_Speed -------------------------------------
 *
 *  Returns port speeds
 *
 *  Parameter:  
 *  Return:                 Port speeds
 *----------------------------------------------------------------------------*/

static U32 USBH_Get_Speed (void) {
  
  return (Port_Speed); 
}


/*------------------------- USBH_EP_Add ----------------------------------------
 *
 *  Add the Endpoint and return handle (address of the Endpoint)
 *
 *  Parameter:  dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 Handle to the Configured Endpoint (0 = FAIL)
 *----------------------------------------------------------------------------*/

static U32 USBH_EP_Add (U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {
  U8 ep_idx;

  ep_idx = ((ptrEPD->bEndpointAddress & 0x0F) << 1);
  if (ep_idx) {
    ep_idx += (((ptrEPD->bEndpointAddress & 0x80) >> 7) ^ 1);
  }

  /* Store all of endpoint descriptor parameters to local structure           */
  USBH_DEV_EP[ep_idx].DEV_ADR = dev_adr;
  USBH_DEV_EP[ep_idx].DEV_SPD = ep_spd;
  memcpy (&USBH_DEV_EP[ep_idx].EP_DESC, ptrEPD, sizeof(USB_ENDPOINT_DESCRIPTOR));

  return ((U32)&USBH_DEV_EP[ep_idx]);
}


/*------------------------- USBH_EP_Config -------------------------------------
 *
 *  (Re)Configure some parameters of the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *              dev_adr:    Device Address
 *              ep_spd:     Endpoint Speed
 *              ptrEPD:     Pointer to the USB Standard Endpoint Descriptor
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_EP_Config (U32 hndl, U8 dev_adr, U8 ep_spd, USB_ENDPOINT_DESCRIPTOR *ptrEPD) {

  if (!hndl) 
    return (__FALSE);

  if (USBH_EP_Add (dev_adr, ep_spd, ptrEPD) != hndl) 
    return (__FALSE);

  return (__TRUE);
}


/*------------------------- USBH_EP_Remove -------------------------------------
 *
 *  Remove the Endpoint
 *
 *  Parameter:  hndl:       Handle to the Configured Endpoint
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_EP_Remove (U32 hndl) {
  U8         ep_idx;
  USBH_URB  *ptr_URB;

  if (!hndl) 
    return (__FALSE);

  ep_idx = USBH_MK_GetEPIndexFromHandle(hndl);
  ptr_URB = USBH_DEV_EP[ep_idx].ptr_URB;/* Pointer to endpoint URB            */
  if (ptr_URB) {                        /* If URB exists cancel it            */
    if (!USBH_URB_Cancel (hndl, ptr_URB)) 
      return (__FALSE);
  }

  /* Clear all of endpoint descriptor parameters in local structure           */
  memset (&USBH_DEV_EP[ep_idx], 0, sizeof(USBH_MK_DEV_EP));

  return (__TRUE);
}


/*------------------------- USBH_URB_Submit ------------------------------------
 *
 *  Submit the URB (USB Request Block) to be processed
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_URB_Submit (U32 hndl, USBH_URB *ptrURB) {
  U32 ep_idx;
  U32 ep_typ;

  if ((!hndl) || (!ptrURB) || (!Port_Con) || (ptrURB->Submitted == 1) || (ptrURB->InProgress == 1))
    return (__FALSE);
  
