MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbh_MK20D5.c
  ptrURB->ptrCurrentDataBuffer = ptrURB->ptrDataBuffer;
  ptrURB->DataTransferred = 0;
  ptrURB->Status          = 0;

  ep_idx                  = USBH_MK_GetEPIndexFromHandle(hndl);
  ep_typ                  = USBH_DEV_EP[ep_idx].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK;
  USBH_DEV_EP[ep_idx].ptr_URB = ptrURB;

  if ((ep_typ == USB_ENDPOINT_TYPE_INTERRUPT) && (!USBH_DEV_EP[ep_idx].cntInterval)) {
                                        /* If interrupt endpoint transfer     */
    USBH_DEV_EP[ep_idx].cntInterval = USBH_DEV_EP[ep_idx].EP_DESC.bInterval;
    if (!USBH_DEV_EP[ep_idx].cntInterval) 
      USBH_DEV_EP[ep_idx].cntInterval = 1;
    ptrURB->Submitted     = 1;
  } else if ((ep_typ == USB_ENDPOINT_TYPE_CONTROL) || (ep_typ == USB_ENDPOINT_TYPE_BULK)) {
    ptrURB->Submitted     = 1;          /* Transfer will start on the next SOF*/
  }

  return (__TRUE);
}


/*------------------------- USBH_URB_Cancel ------------------------------------
 *
 *  Cancel the URB (USB Request Block)
 *
 *  Parameter:  hndl:       Endpoint handle (Endpoint address in memory)
 *              ptrURB:     Pointer to the URB
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

static BOOL USBH_URB_Cancel (U32 hndl, USBH_URB *ptrURB) {
  U8 ep_idx;

  if ((!hndl) || (!ptrURB)) 
    return (__FALSE);

  if (!ptrURB->Submitted) 
    return (__TRUE);

  ptrURB->Submitted = 0;

  ep_idx = USBH_MK_GetEPIndexFromHandle(hndl);
  if (ptrURB->InProgress == 1) {
    if (USBH_MK_TransferCancel (hndl))  /* Stop Transfer                      */
      return (__FALSE);
    ptrURB->InProgress  = 0;
  }

  if (!USBH_DEV_EP[ep_idx].cntInterval){/* If interrupt endpoint transfer     */
    USBH_DEV_EP[ep_idx].cntInterval = 0;/* Disable transmission on next SOF   */
  }
  ptrURB->Cancelled = 1;

  return (__TRUE);
}


/*------------------------- IRQ Handler ----------------------------------------
 *
 *  USB Interrupt Handler Routine
 *
 *  Parameter:
 *  Return:
 *----------------------------------------------------------------------------*/

void USB0_IRQHandler (void) {
  U8         istat, inten, errstat, ep_idx, bd_idx, ep, stat;
  U16        len;
  static U32 error_msk, completed_msk, retransmit_msk, transmit_msk;
  USBH_URB  *ptr_URB;

  istat    = USB0->ISTAT;
  inten    = USB0->INTEN;
  istat   &= inten;
  errstat  = USB0->ERRSTAT;

  if (istat & (1 << 6)) {               /* If ATTACH interrupt occured        */
    if (!Port_Con) {
      cntDebounce  = DEBOUNCE_500ms;
      Port_Speed   = (USB0->CTL >> 7)&1;/* Determine attached device speed    */
      if (!Port_Speed) {
        USB0->ADDR   |= 0x80;           /* Enable low speed                   */
      }
      error_msk       = 0;
      completed_msk   = 0;
      retransmit_msk  = 0;
      transmit_msk    = 0;
    }
    USB0->INTEN  &= ~USB_INTEN_ATTACHEN_MASK;     /* Disable ATTACH interrupt */
  }

  if (istat & (1 << 1)) {               /* If ERROR  interrupt occured        */
    for (ep = 0; ep < (OTG_MAX_EP*2); ep++){/* Go through all Endpoints       */
      ptr_URB = USBH_DEV_EP[ep].ptr_URB;    /* Pointer to endpoints URB       */
      if (ptr_URB) {                              /* If URB is valid (!= 0)   */
        if ((ptr_URB->Submitted  == 1) &&         /* If URB is submitted      */
            (ptr_URB->InProgress == 1)) {         /* If URB is in progress    */
          switch (errstat) {
            case USB_ERRSTAT_BTSERR_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_BSTUFF;
              error_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_DMAERR_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_DOVER;
              error_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_BTOERR_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_BUSTT;
              retransmit_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_DFN8_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_OTHER;
              error_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_CRC16_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_CRC;
              error_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_CRC5EOF_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_FEOP;
              error_msk |= (1 << ep);
              break;              
            case USB_ERRSTAT_PIDERR_MASK:
              ptr_URB->Error  = USBH_TR_ERROR_PID;
              error_msk |= (1 << ep);
              break;              
          }
          break;
        }
      }
    }
    USB0->ERRSTAT = errstat;            /* Clear all errors                   */
  }

  if (istat & (1 << 3)) {               /* If TOKDNE interrupt occured        */
    stat    =    USB0->STAT & 0x0F;
                                        /* Find out Endpoint Index            */
    ep_idx  = (((USB0->TOKEN) & 0x0F) << 1) + ((stat >> 3) & 0x01);
    if (ep_idx == 1)
      ep_idx = 0;
    bd_idx  =   (stat >> 2)   & 0x03;   /* Find out Buffer Descriptor Index   */
                                        /* Only ENDPNT0 is used               */
    ptr_URB =  USBH_DEV_EP[ep_idx].ptr_URB;               /* Pointer to ep URB*/
    switch (USBH_MK_BDT[bd_idx].TOK_PID) {
      case 0x00:                        /* Bus Timeout                        */
        ptr_URB->ResponsePacketType = USBH_PACKET_RESERVED;
        retransmit_msk             |= (1 << ep_idx);
        break;
      case 0x02:                        /* ACK                                */
        ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
        if (ep_idx <= 1) {
          EP_Data ^= 0x03;              /* Toggle last EP0 data type          */
        } else {
          EP_Data ^= (1 << ep_idx);     /* Toggle last data type              */
        }
        break;
      case 0x03:                        /* DATA0                              */
        ptr_URB->ResponsePacketType = USBH_PACKET_DATA0;
        ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
        if (ep_idx <= 1) {
          EP_Data ^= 0x03;              /* Toggle last EP0 data type          */
        } else {
          EP_Data ^= (1 << ep_idx);     /* Toggle last data type              */
        }
        break;
      case 0x0A:                        /* NAK                                */
        ptr_URB->ResponsePacketType = USBH_PACKET_NAK;
        break;
      case 0x0B:                        /* DATA1                              */
        ptr_URB->ResponsePacketType = USBH_PACKET_DATA1;
        ptr_URB->ResponsePacketType = USBH_PACKET_ACK;
        if (ep_idx <= 1) {
          EP_Data ^= 0x03;              /* Toggle last EP0 data type          */
        } else {
          EP_Data ^= (1 << ep_idx);     /* Toggle last data type              */
        }
        break;
      case 0x0E:                        /* STALL                              */
        ptr_URB->ResponsePacketType = USBH_PACKET_STALL;
        break;
      case 0x0F:                        /* Data Error                         */
        ptr_URB->ResponsePacketType = USBH_PACKET_RESERVED;
        error_msk                  |= (1 << ep_idx);
        break;
      default:                          /* Undefined                          */
        ptr_URB->ResponsePacketType = USBH_PACKET_RESERVED;
        error_msk                  |= (1 << ep_idx);
        break;
    }
    len = USBH_MK_BDT[bd_idx].BC;
    if (retransmit_msk & (1 << ep_idx))
      len = 0;
    if (!(error_msk & (1 << ep_idx))) { /* If there was no error              */
      ptr_URB->DataTransferred      += len;
      ptr_URB->ptrCurrentDataBuffer += len;
      if (ptr_URB->DataTransferred >= ptr_URB->DataLength) {
        completed_msk  |= 1 << ep_idx;
      } else if (ptr_URB->DataTransferred < ptr_URB->DataLength) { 
        if ((USBH_DEV_EP[ep_idx].EP_DESC.bmAttributes & USB_ENDPOINT_TYPE_MASK) == USB_ENDPOINT_TYPE_INTERRUPT) 
          completed_msk |= 1 << ep_idx;
        else
          transmit_msk  |= 1 << ep_idx;
      }
    }

    HW_Busy             = 0;
    if (error_msk      & (1 << ep_idx)) {
      ptr_URB->Submitted  = 0;
      ptr_URB->InProgress = 0;
      ptr_URB->Completed  = 1;
      USBH_DEV_EP[ep_idx].ptr_URB = 0;
    } else if (completed_msk  & (1 << ep_idx)) {
      if (ptr_URB->DataTransferred > ptr_URB->DataLength)
        ptr_URB->Error    = USBH_TR_ERROR_DOVER;
      ptr_URB->Submitted  = 0;
      ptr_URB->InProgress = 0;
      ptr_URB->Completed  = 1;
      USBH_DEV_EP[ep_idx].ptr_URB = 0;
      if (ptr_URB->Completed && ptr_URB->CompletedCallback) {
        ptr_URB->CompletedCallback();
      }
    } else if (retransmit_msk & (1 << ep_idx)) {
      retransmit_msk     &= ~(1 << ep_idx);
      ptr_URB->Status     = 0;
      ptr_URB->Submitted  = 1;
    } else if (transmit_msk & (1 << ep_idx)) {
      retransmit_msk     &= ~(1 << ep_idx);
      ptr_URB->Status     = 0;
      ptr_URB->Submitted  = 1;
      ptr_URB->InProgress = 1;
      ptr_URB->Completed  = 0;
      USBH_MK_TransferEnqueue ((U32)&USBH_DEV_EP[ep_idx], (U8)ptr_URB->Parameters, (U8 *)ptr_URB->ptrCurrentDataBuffer, (U32)ptr_URB->DataLength-(U32)ptr_URB->DataTransferred);
    }
    error_msk      &= ~(1 << ep_idx);
    completed_msk  &= ~(1 << ep_idx);
    retransmit_msk &= ~(1 << ep_idx);
    transmit_msk   &= ~(1 << ep_idx);
  }

